{"vocab_size": 2000, "merges": {"224,164": 256, "101,32": 257, "115,32": 258, "116,104": 259, "224,165": 260, "32,256": 261, "97,110": 262, "105,110": 263, "100,32": 264, "101,114": 265, "111,110": 266, "44,32": 267, "259,257": 268, "116,32": 269, "97,108": 270, "116,105": 271, "101,110": 272, "111,114": 273, "121,32": 274, "97,114": 275, "256,190": 276, "102,32": 277, "111,277": 278, "114,101": 279, "101,264": 280, "115,116": 281, "260,141": 282, "282,256": 283, "105,99": 284, "262,264": 285, "46,32": 286, "111,32": 287, "276,256": 288, "114,111": 289, "271,266": 290, "97,116": 291, "263,32": 292, "263,103": 293, "270,32": 294, "97,32": 295, "256,191": 296, "260,135": 297, "101,115": 298, "116,287": 299, "296,256": 300, "111,117": 301, "101,258": 302, "101,108": 303, "293,32": 304, "265,32": 305, "99,104": 306, "105,258": 307, "97,258": 308, "111,108": 309, "261,149": 310, "105,116": 311, "111,109": 312, "262,32": 313, "10,10": 314, "256,130": 315, "256,176": 316, "105,115": 317, "114,97": 318, "97,115": 319, "117,114": 320, "273,32": 321, "101,99": 322, "109,32": 323, "260,128": 324, "105,108": 325, "97,290": 326, "101,109": 327, "84,104": 328, "260,139": 329, "97,269": 330, "114,105": 331, "272,116": 332, "100,105": 333, "259,32": 334, "108,274": 335, "266,32": 336, "256,168": 337, "297,261": 338, "110,32": 339, "117,108": 340, "115,105": 341, "272,32": 342, "97,109": 343, "97,99": 344, "117,115": 345, "108,101": 346, "46,314": 347, "97,98": 348, "278,268": 349, "276,261": 350, "256,164": 351, "99,266": 352, "97,103": 353, "119,104": 354, "111,119": 355, "256,149": 356, "271,99": 357, "111,115": 358, "101,100": 359, "117,110": 360, "115,267": 361, "104,32": 362, "101,116": 363, "111,112": 364, "328,257": 365, "261,174": 366, "119,105": 367, "108,105": 368, "108,32": 369, "111,103": 370, "105,114": 371, "112,289": 372, "118,257": 373, "260,136": 374, "118,265": 375, "259,330": 376, "115,117": 377, "283,176": 378, "261,184": 379, "272,269": 380, "284,32": 381, "288,168": 382, "256,184": 383, "101,120": 384, "108,257": 385, "104,97": 386, "100,101": 387, "290,32": 388, "98,274": 389, "10,32": 390, "326,32": 391, "99,105": 392, "102,321": 393, "267,285": 394, "102,273": 395, "279,115": 396, "275,257": 397, "292,268": 398, "105,109": 399, "367,334": 400, "116,265": 401, "185,374": 402, "261,170": 403, "97,100": 404, "259,101": 405, "306,32": 406, "97,112": 407, "260,129": 408, "119,308": 409, "289,323": 410, "105,103": 411, "111,116": 412, "99,312": 413, "265,257": 414, "39,258": 415, "32,40": 416, "102,410": 417, "99,257": 418, "301,110": 419, "256,181": 420, "256,178": 421, "283,175": 422, "112,104": 423, "324,261": 424, "258,278": 425, "262,103": 426, "112,108": 427, "109,97": 428, "297,315": 429, "101,267": 430, "115,112": 431, "101,275": 432, "309,370": 433, "286,365": 434, "256,174": 435, "113,117": 436, "262,100": 437, "101,281": 438, "310,338": 439, "112,265": 440, "300,149": 441, "260,164": 442, "107,32": 443, "99,108": 444, "291,257": 445, "121,267": 446, "259,305": 447, "117,109": 448, "41,32": 449, "65,109": 450, "98,101": 451, "256,185": 452, "100,117": 453, "111,99": 454, "115,101": 455, "65,108": 456, "284,294": 457, "49,57": 458, "111,100": 459, "288,176": 460, "102,102": 461, "117,100": 462, "101,97": 463, "226,128": 464, "118,105": 465, "119,273": 466, "112,275": 467, "256,175": 468, "105,281": 469, "289,112": 470, "270,335": 471, "110,111": 472, "261,181": 473, "322,116": 474, "286,73": 475, "98,257": 476, "266,103": 477, "98,117": 478, "301,114": 479, "299,268": 480, "284,362": 481, "311,274": 482, "109,101": 483, "291,280": 484, "256,170": 485, "115,104": 486, "354,481": 487, "48,48": 488, "258,285": 489, "281,265": 490, "257,278": 491, "318,98": 492, "256,166": 493, "298,267": 494, "65,110": 495, "260,130": 496, "366,429": 497, "316,261": 498, "101,119": 499, "114,262": 500, "105,269": 501, "44,261": 502, "65,492": 503, "340,116": 504, "329,315": 505, "256,151": 506, "267,268": 507, "104,307": 508, "386,373": 509, "300,175": 510, "115,286": 511, "83,116": 512, "304,268": 513, "472,269": 514, "117,116": 515, "270,108": 516, "112,279": 517, "99,332": 518, "115,287": 519, "298,269": 520, "99,101": 521, "403,378": 522, "281,114": 523, "119,414": 524, "357,32": 525, "303,369": 526, "117,112": 527, "101,118": 528, "111,98": 529, "395,109": 530, "118,303": 531, "426,117": 532, "115,121": 533, "352,116": 534, "270,369": 535, "532,353": 536, "280,389": 537, "100,265": 538, "104,308": 539, "103,104": 540, "32,285": 541, "348,273": 542, "109,262": 543, "100,97": 544, "103,105": 545, "156,283": 546, "316,283": 547, "546,158": 548, "275,105": 549, "97,271": 550, "450,490": 551, "259,265": 552, "275,32": 553, "548,382": 554, "272,100": 555, "319,107": 556, "464,147": 557, "302,278": 558, "358,269": 559, "102,116": 560, "280,299": 561, "453,99": 562, "371,32": 563, "111,111": 564, "32,278": 565, "108,264": 566, "105,122": 567, "111,447": 568, "115,111": 569, "50,48": 570, "112,101": 571, "58,32": 572, "275,274": 573, "297,256": 574, "456,556": 575, "108,536": 576, "306,327": 577, "105,100": 578, "116,258": 579, "272,418": 580, "261,148": 581, "97,263": 582, "266,257": 583, "286,328": 584, "315,256": 585, "312,257": 586, "270,519": 587, "303,108": 588, "475,339": 589, "112,273": 590, "402,442": 591, "117,279": 592, "309,108": 593, "377,406": 594, "280,292": 595, "275,103": 596, "320,257": 597, "98,108": 598, "301,258": 599, "444,462": 600, "114,284": 601, "261,176": 602, "103,362": 603, "85,110": 604, "301,269": 605, "265,258": 606, "115,269": 607, "337,329": 608, "49,56": 609, "320,294": 610, "109,273": 611, "283,164": 612, "288,164": 613, "286,65": 614, "34,32": 615, "343,257": 616, "300,164": 617, "271,109": 618, "411,104": 619, "279,99": 620, "119,101": 621, "111,375": 622, "111,118": 623, "110,355": 624, "288,156": 625, "309,105": 626, "59,32": 627, "311,258": 628, "269,278": 629, "272,99": 630, "261,156": 631, "112,358": 632, "331,281": 633, "99,313": 634, "41,267": 635, "298,257": 636, "280,268": 637, "261,133": 638, "413,109": 639, "291,302": 640, "503,381": 641, "102,105": 642, "112,111": 643, "263,600": 644, "405,563": 645, "262,269": 646, "73,110": 647, "100,317": 648, "67,104": 649, "259,470": 650, "258,292": 651, "256,163": 652, "310,350": 653, "283,165": 654, "402,315": 655, "109,559": 656, "478,269": 657, "116,318": 658, "112,396": 659, "259,307": 660, "650,433": 661, "386,264": 662, "317,104": 663, "499,32": 664, "306,111": 665, "257,268": 666, "633,412": 667, "274,278": 668, "594,308": 669, "263,116": 670, "259,313": 671, "119,97": 672, "408,256": 673, "102,263": 674, "451,342": 675, "283,183": 676, "366,608": 677, "102,108": 678, "105,112": 679, "104,257": 680, "275,100": 681, "265,339": 682, "261,185": 683, "117,99": 684, "263,401": 685, "99,331": 686, "272,271": 687, "103,272": 688, "518,320": 689, "377,98": 690, "97,267": 691, "611,257": 692, "263,99": 693, "98,322": 694, "301,566": 695, "114,311": 696, "109,325": 697, "288,130": 698, "103,289": 699, "473,300": 700, "336,268": 701, "288,178": 702, "303,32": 703, "102,371": 704, "109,332": 705, "413,112": 706, "66,526": 707, "262,116": 708, "286,72": 709, "275,109": 710, "310,329": 711, "110,101": 712, "288,184": 713, "270,577": 714, "285,268": 715, "544,323": 716, "348,385": 717, "116,97": 718, "116,331": 719, "477,32": 720, "319,269": 721, "326,294": 722, "271,116": 723, "417,268": 724, "310,424": 725, "65,667": 726, "569,392": 727, "117,258": 728, "319,115": 729, "98,363": 730, "46,390": 731, "261,168": 732, "105,118": 733, "105,271": 734, "100,305": 735, "118,549": 736, "256,188": 737, "379,338": 738, "258,299": 739, "102,344": 740, "262,661": 741, "48,32": 742, "283,181": 743, "400,268": 744, "97,345": 745, "108,596": 746, "256,154": 747, "551,716": 748, "101,375": 749, "116,280": 750, "419,264": 751, "420,300": 752, "99,275": 753, "107,257": 754, "288,174": 755, "261,172": 756, "99,419": 757, "311,280": 758, "259,301": 759, "115,265": 760, "265,284": 761, "575,295": 762, "279,108": 763, "256,167": 764, "300,178": 765, "303,274": 766, "115,347": 767, "289,117": 768, "116,500": 769, "263,257": 770, "405,274": 771, "65,114": 772, "450,761": 773, "275,264": 774, "98,111": 775, "109,380": 776, "116,119": 777, "112,114": 778, "121,432": 779, "270,107": 780, "372,562": 781, "100,343": 782, "391,278": 783, "266,335": 784, "112,117": 785, "290,258": 786, "194,160": 787, "103,318": 788, "298,115": 789, "73,339": 790, "364,104": 791, "621,342": 792, "704,607": 793, "291,305": 794, "393,268": 795, "105,102": 796, "281,291": 797, "99,111": 798, "307,268": 799, "279,319": 800, "256,159": 801, "105,313": 802, "284,257": 803, "310,316": 804, "110,448": 805, "107,624": 806, "100,304": 807, "469,273": 808, "302,285": 809, "542,388": 810, "318,99": 811, "100,298": 812, "262,99": 813, "275,101": 814, "364,340": 815, "115,586": 816, "100,322": 817, "730,792": 818, "99,479": 819, "601,504": 820, "560,305": 821, "102,265": 822, "262,274": 823, "67,266": 824, "109,263": 825, "97,121": 826, "49,55": 827, "354,287": 828, "135,383": 829, "121,112": 830, "100,257": 831, "375,115": 832, "543,274": 833, "261,166": 834, "112,815": 835, "258,397": 836, "333,461": 837, "116,101": 838, "99,273": 839, "286,83": 840, "351,378": 841, "262,418": 842, "301,115": 843, "351,350": 844, "108,437": 845, "352,341": 846, "263,299": 847, "283,174": 848, "98,305": 849, "308,295": 850, "103,110": 851, "115,320": 852, "343,112": 853, "346,103": 854, "466,107": 855, "109,459": 856, "317,105": 857, "121,115": 858, "256,161": 859, "279,264": 860, "357,294": 861, "407,112": 862, "311,121": 863, "785,598": 864, "101,112": 865, "334,689": 866, "143,356": 867, "581,316": 868, "329,506": 869, "71,279": 870, "115,392": 871, "388,278": 872, "99,320": 873, "115,10": 874, "291,116": 875, "108,97": 876, "355,32": 877, "428,274": 878, "98,319": 879, "105,97": 880, "780,262": 881, "271,373": 882, "307,295": 883, "258,40": 884, "105,294": 885, "322,266": 886, "103,108": 887, "119,696": 888, "353,257": 889, "115,303": 890, "256,172": 891, "65,32": 892, "308,268": 893, "387,531": 894, "894,364": 895, "523,684": 896, "112,331": 897, "550,373": 898, "359,267": 899, "306,426": 900, "495,291": 901, "99,265": 902, "261,175": 903, "97,118": 904, "115,109": 905, "777,287": 906, "383,654": 907, "581,498": 908, "114,317": 909, "752,554": 910, "263,118": 911, "101,103": 912, "109,275": 913, "405,273": 914, "101,286": 915, "540,269": 916, "256,156": 917, "98,265": 918, "376,268": 919, "50,488": 920, "291,265": 921, "115,266": 922, "119,526": 923, "551,782": 924, "604,758": 925, "109,111": 926, "338,655": 927, "298,258": 928, "116,267": 929, "104,448": 930, "901,626": 931, "120,105": 932, "101,269": 933, "348,605": 934, "98,359": 935, "759,603": 936, "97,821": 937, "574,182": 938, "259,768": 939, "483,259": 940, "571,364": 941, "361,285": 942, "65,117": 943, "274,285": 944, "533,281": 945, "302,292": 946, "602,625": 947, "103,279": 948, "107,342": 949, "281,445": 950, "325,358": 951, "117,323": 952, "273,103": 953, "256,173": 954, "115,723": 955, "327,332": 956, "272,115": 957, "257,285": 958, "110,266": 959, "322,269": 960, "347,365": 961, "951,791": 962, "760,118": 963, "288,181": 964, "69,117": 965, "330,268": 966, "271,118": 967, "584,307": 968, "326,258": 969, "261,182": 970, "110,343": 971, "261,137": 972, "510,350": 973, "32,39": 974, "98,105": 975, "37,32": 976, "115,97": 977, "107,304": 978, "325,32": 979, "99,504": 980, "353,820": 981, "115,363": 982, "475,269": 983, "260,131": 984, "300,143": 985, "440,105": 986, "261,173": 987, "932,312": 988, "384,116": 989, "346,267": 990, "527,32": 991, "623,305": 992, "564,264": 993, "358,257": 994, "387,112": 995, "261,164": 996, "256,182": 997, "300,174": 998, "677,910": 999, "67,32": 1000, "102,101": 1001, "108,100": 1002, "115,301": 1003, "98,273": 1004, "98,385": 1005, "354,342": 1006, "98,303": 1007, "108,263": 1008, "101,259": 1009, "317,362": 1010, "317,269": 1011, "104,121": 1012, "925,512": 1013, "521,112": 1014, "431,322": 1015, "325,257": 1016, "97,281": 1017, "622,110": 1018, "108,454": 1019, "370,318": 1020, "266,267": 1021, "634,476": 1022, "281,437": 1023, "111,461": 1024, "354,414": 1025, "394,268": 1026, "293,267": 1027, "78,273": 1028, "119,695": 1029, "99,482": 1030, "109,265": 1031, "259,636": 1032, "270,258": 1033, "570,49": 1034, "104,101": 1035, "262,399": 1036, "110,664": 1037, "367,259": 1038, "333,281": 1039, "432,335": 1040, "310,324": 1041, "101,274": 1042, "99,319": 1043, "806,339": 1044, "345,280": 1045, "289,116": 1046, "115,108": 1047, "290,267": 1048, "346,120": 1049, "907,382": 1050, "104,619": 1051, "110,273": 1052, "1020,423": 1053, "390,390": 1054, "300,168": 1055, "97,988": 1056, "327,380": 1057, "259,414": 1058, "325,108": 1059, "273,411": 1060, "117,294": 1061, "100,258": 1062, "348,108": 1063, "286,77": 1064, "111,45": 1065, "270,935": 1066, "286,70": 1067, "427,344": 1068, "97,259": 1069, "114,121": 1070, "455,269": 1071, "311,257": 1072, "688,265": 1073, "258,268": 1074, "368,109": 1075, "279,257": 1076, "327,112": 1077, "384,853": 1078, "82,101": 1079, "965,470": 1080, "431,111": 1081, "116,304": 1082, "286,66": 1083, "105,32": 1084, "773,313": 1085, "39,32": 1086, "466,1002": 1087, "428,263": 1088, "102,710": 1089, "103,1018": 1090, "67,477": 1091, "325,274": 1092, "101,461": 1093, "270,267": 1094, "104,808": 1095, "97,264": 1096, "356,676": 1097, "303,101": 1098, "102,343": 1099, "837,265": 1100, "372,99": 1101, "114,117": 1102, "261,829": 1103, "463,406": 1104, "593,355": 1105, "257,299": 1106, "262,110": 1107, "105,302": 1108, "69,110": 1109, "283,159": 1110, "351,927": 1111, "486,679": 1112, "79,114": 1113, "1091,396": 1114, "753,98": 1115, "99,593": 1116, "557,32": 1117, "100,312": 1118, "87,104": 1119, "317,109": 1120, "280,295": 1121, "326,267": 1122, "502,156": 1123, "102,360": 1124, "465,100": 1125, "407,571": 1126, "117,471": 1127, "288,175": 1128, "283,149": 1129, "46,10": 1130, "97,292": 1131, "341,336": 1132, "693,800": 1133, "261,151": 1134, "97,117": 1135, "433,121": 1136, "256,165": 1137, "439,178": 1138, "100,320": 1139, "99,279": 1140, "281,462": 1141, "101,323": 1142, "262,258": 1143, "463,107": 1144, "590,116": 1145, "261,591": 1146, "408,316": 1147, "533,306": 1148, "110,722": 1149, "272,103": 1150, "464,141": 1151, "503,284": 1152, "44,488": 1153, "110,291": 1154, "341,266": 1155, "105,264": 1156, "102,97": 1157, "423,962": 1158, "283,184": 1159, "282,1151": 1160, "279,545": 1161, "726,385": 1162, "281,289": 1163, "953,262": 1164, "467,357": 1165, "302,268": 1166, "258,349": 1167, "290,294": 1168, "170,378": 1169, "473,422": 1170, "438,682": 1171, "112,811": 1172, "939,603": 1173, "83,301": 1174, "99,745": 1175, "102,340": 1176, "97,274": 1177, "300,184": 1178, "333,620": 1179, "355,305": 1180, "266,100": 1181, "109,112": 1182, "302,397": 1183, "260,140": 1184, "496,485": 1185, "297,310": 1186, "104,105": 1187, "109,345": 1188, "479,32": 1189, "118,270": 1190, "279,103": 1191, "105,832": 1192, "100,284": 1193, "805,849": 1194, "355,749": 1195, "279,436": 1196, "102,1105": 1197, "32,299": 1198, "644,304": 1199, "101,313": 1200, "478,325": 1201, "110,287": 1202, "846,538": 1203, "263,418": 1204, "110,412": 1205, "534,263": 1206, "1138,985": 1207, "941,385": 1208, "258,376": 1209, "337,408": 1210, "333,270": 1211, "108,285": 1212, "995,555": 1213, "870,101": 1214, "344,443": 1215, "259,327": 1216, "1060,263": 1217, "340,553": 1218, "686,112": 1219, "346,116": 1220, "310,973": 1221, "115,312": 1222, "109,359": 1223, "359,265": 1224, "482,278": 1225, "403,316": 1226, "261,178": 1227, "466,443": 1228, "272,264": 1229, "1081,949": 1230, "665,803": 1231, "396,112": 1232, "372,118": 1233, "267,295": 1234, "97,306": 1235, "419,100": 1236, "389,268": 1237, "109,266": 1238, "1056,565": 1239, "116,274": 1240, "105,277": 1241, "111,560": 1242, "257,292": 1243, "114,274": 1244, "107,258": 1245, "298,347": 1246, "642,303": 1247, "699,527": 1248, "261,867": 1249, "395,323": 1250, "286,79": 1251, "115,434": 1252, "32,292": 1253, "109,117": 1254, "114,294": 1255, "678,117": 1256, "778,266": 1257, "319,880": 1258, "101,46": 1259, "306,110": 1260, "775,334": 1261, "433,457": 1262, "659,332": 1263, "613,848": 1264, "271,115": 1265, "943,1163": 1266, "741,274": 1267, "99,516": 1268, "1242,342": 1269, "271,108": 1270, "267,487": 1271, "103,101": 1272, "310,676": 1273, "80,104": 1274, "83,111": 1275, "959,45": 1276, "118,304": 1277, "273,116": 1278, "297,841": 1279, "1264,356": 1280, "930,313": 1281, "694,616": 1282, "262,257": 1283, "101,271": 1284, "111,459": 1285, "859,737": 1286, "283,166": 1287, "350,184": 1288, "683,329": 1289, "665,309": 1290, "119,312": 1291, "101,436": 1292, "119,325": 1293, "269,349": 1294, "876,119": 1295, "109,363": 1296, "288,151": 1297, "403,498": 1298, "293,117": 1299, "118,272": 1300, "115,309": 1301, "97,107": 1302, "458,57": 1303, "355,339": 1304, "98,564": 1305, "585,167": 1306, "341,100": 1307, "121,108": 1308, "1266,1258": 1309, "374,256": 1310, "1310,554": 1311, "1311,441": 1312, "537,268": 1313, "116,320": 1314, "284,471": 1315, "116,305": 1316, "276,442": 1317, "181,300": 1318, "856,682": 1319, "112,1148": 1320, "291,304": 1321, "101,102": 1322, "73,32": 1323, "469,258": 1324, "115,616": 1325, "299,476": 1326, "341,851": 1327, "112,305": 1328, "99,262": 1329, "50,32": 1330, "34,267": 1331, "295,285": 1332, "350,174": 1333, "270,567": 1334, "945,327": 1335, "283,167": 1336, "288,170": 1337, "356,612": 1338, "468,869": 1339, "78,529": 1340, "360,100": 1341, "156,613": 1342, "67,312": 1343, "697,368": 1344, "109,404": 1345, "257,349": 1346, "116,830": 1347, "455,375": 1348, "263,101": 1349, "379,435": 1350, "261,154": 1351, "428,106": 1352, "293,258": 1353, "108,794": 1354, "112,291": 1355, "97,371": 1356, "317,323": 1357, "279,368": 1358, "451,395": 1359, "505,439": 1360, "115,336": 1361, "275,323": 1362, "1066,287": 1363, "501,307": 1364, "347,790": 1365, "354,1016": 1366, "114,272": 1367, "449,285": 1368, "1028,334": 1369, "261,134": 1370, "261,655": 1371, "147,315": 1372, "452,460": 1373, "87,273": 1374, "483,333": 1375, "104,265": 1376, "102,751": 1377, "451,304": 1378, "346,415": 1379, "357,108": 1380, "112,112": 1381, "100,111": 1382, "438,1063": 1383, "764,422": 1384, "300,176": 1385, "311,265": 1386, "275,751": 1387, "74,111": 1388, "1211,474": 1389, "495,399": 1390, "46,83": 1391, "341,1005": 1392, "1194,278": 1393, "360,735": 1394, "539,675": 1395, "115,314": 1396, "746,257": 1397, "49,53": 1398, "1273,1279": 1399, "261,402": 1400, "903,452": 1401, "256,136": 1402, "955,117": 1403, "97,325": 1404, "672,274": 1405, "709,257": 1406, "284,105": 1407, "118,101": 1408, "114,257": 1409, "289,119": 1410, "509,675": 1411, "263,1256": 1412, "118,371": 1413, "639,360": 1414, "819,269": 1415, "102,1224": 1416, "104,309": 1417, "580,278": 1418, "266,101": 1419, "351,424": 1420, "288,154": 1421, "658,333": 1422, "75,104": 1423, "65,103": 1424, "109,317": 1425, "490,339": 1426, "552,339": 1427, "85,1391": 1428, "1309,525": 1429, "375,274": 1430, "263,392": 1431, "99,695": 1432, "105,279": 1433, "368,754": 1434, "838,1260": 1435, "98,114": 1436, "355,110": 1437, "493,938": 1438, "576,257": 1439, "1012,100": 1440, "387,674": 1441, "454,873": 1442, "115,107": 1443, "292,295": 1444, "259,1076": 1445, "97,461": 1446, "65,341": 1447, "298,286": 1448, "1115,336": 1449, "352,896": 1450, "116,327": 1451, "302,376": 1452, "427,284": 1453, "259,994": 1454, "298,112": 1455, "116,279": 1456, "115,41": 1457, "265,267": 1458, "1348,294": 1459, "275,335": 1460, "283,178": 1461, "315,841": 1462, "288,136": 1463, "66,588": 1464, "1153,742": 1465, "99,470": 1466, "98,279": 1467, "118,342": 1468, "52,32": 1469, "1195,267": 1470, "729,457": 1471, "347,83": 1472, "401,109": 1473, "80,275": 1474, "451,103": 1475, "947,1050": 1476, "324,468": 1477, "1214,443": 1478, "279,1088": 1479, "1388,104": 1480, "112,309": 1481, "116,1098": 1482, "114,426": 1483, "583,349": 1484, "360,538": 1485, "77,275": 1486, "1206,117": 1487, "115,322": 1488, "879,280": 1489, "288,1372": 1490, "256,183": 1491, "1172,357": 1492, "271,313": 1493, "67,108": 1494, "65,99": 1495, "67,262": 1496, "575,97": 1497, "281,640": 1498, "280,398": 1499, "109,272": 1500, "857,336": 1501, "341,697": 1502, "324,356": 1503, "886,312": 1504, "431,1144": 1505, "118,355": 1506, "1259,103": 1507, "523,284": 1508, "273,274": 1509, "105,387": 1510, "78,101": 1511, "262,267": 1512, "383,338": 1513, "104,303": 1514, "1222,101": 1515, "265,103": 1516, "746,520": 1517, "1124,99": 1518, "100,363": 1519, "279,404": 1520, "66,111": 1521, "280,376": 1522, "288,185": 1523, "116,342": 1524, "291,592": 1525, "478,116": 1526, "1164,567": 1527, "772,1380": 1528, "119,588": 1529, "344,116": 1530, "109,623": 1531, "118,302": 1532, "272,521": 1533, "614,32": 1534, "368,102": 1535, "399,1145": 1536, "332,258": 1537, "700,182": 1538, "522,1438": 1539, "49,54": 1540, "105,120": 1541, "714,457": 1542, "77,459": 1543, "309,117": 1544, "465,499": 1545, "467,116": 1546, "814,295": 1547, "65,115": 1548, "576,302": 1549, "757,719": 1550, "273,269": 1551, "68,515": 1552, "345,257": 1553, "1100,380": 1554, "1383,663": 1555, "1254,406": 1556, "405,323": 1557, "350,591": 1558, "383,612": 1559, "366,382": 1560, "1139,513": 1561, "65,1049": 1562, "411,110": 1563, "97,323": 1564, "301,116": 1565, "99,407": 1566, "308,923": 1567, "1265,362": 1568, "78,722": 1569, "517,851": 1570, "1440,289": 1571, "1293,369": 1572, "102,269": 1573, "108,121": 1574, "280,308": 1575, "401,110": 1576, "111,552": 1577, "306,275": 1578, "273,100": 1579, "604,1192": 1580, "337,297": 1581, "379,654": 1582, "468,337": 1583, "433,274": 1584, "440,399": 1585, "289,115": 1586, "71,318": 1587, "112,626": 1588, "1114,258": 1589, "1013,640": 1590, "1345,257": 1591, "49,48": 1592, "694,745": 1593, "304,295": 1594, "796,284": 1595, "71,101": 1596, "310,296": 1597, "82,312": 1598, "839,807": 1599, "1562,437": 1600, "291,766": 1601, "440,530": 1602, "270,334": 1603, "263,115": 1604, "69,120": 1605, "115,293": 1606, "311,446": 1607, "464,148": 1608, "298,394": 1609, "102,284": 1610, "99,309": 1611, "49,51": 1612, "673,150": 1613, "288,166": 1614, "283,170": 1615, "714,274": 1616, "103,830": 1617, "99,622": 1618, "354,330": 1619, "195,169": 1620, "107,267": 1621, "114,266": 1622, "361,268": 1623, "1154,610": 1624, "377,109": 1625, "109,327": 1626, "757,116": 1627, "262,271": 1628, "98,263": 1629, "304,299": 1630, "298,314": 1631, "1210,383": 1632, "485,1147": 1633, "67,332": 1634, "46,267": 1635, "72,808": 1636, "99,340": 1637, "275,306": 1638, "727,294": 1639, "103,103": 1640, "294,70": 1641, "108,1180": 1642, "102,363": 1643, "981,610": 1644, "749,274": 1645, "317,267": 1646, "106,474": 1647, "111,121": 1648, "102,325": 1649, "344,99": 1650, "115,306": 1651, "98,500": 1652, "69,1617": 1653, "281,275": 1654, "115,1290": 1655, "280,285": 1656, "332,294": 1657, "1161,266": 1658, "98,289": 1659, "345,341": 1660, "119,794": 1661, "980,610": 1662, "1413,266": 1663, "1552,406": 1664, "726,1379": 1665, "542,290": 1666, "430,268": 1667, "407,372": 1668, "32,307": 1669, "110,322": 1670, "528,305": 1671, "259,342": 1672, "108,370": 1673, "108,928": 1674, "286,456": 1675, "364,265": 1676, "49,32": 1677, "100,303": 1678, "72,265": 1679, "510,505": 1680, "297,316": 1681, "379,585": 1682, "151,468": 1683, "262,392": 1684, "1352,321": 1685, "111,264": 1686, "391,285": 1687, "779,258": 1688, "115,886": 1689, "98,262": 1690, "1344,336": 1691, "736,1284": 1692, "270,936": 1693, "278,295": 1694, "271,369": 1695, "377,112": 1696, "117,333": 1697, "1007,105": 1698, "400,295": 1699, "317,377": 1700, "356,460": 1701, "337,338": 1702, "844,402": 1703, "315,506": 1704, "984,351": 1705, "77,345": 1706, "344,107": 1707, "763,484": 1708, "618,302": 1709, "291,101": 1710, "681,258": 1711, "322,105": 1712, "104,270": 1713, "407,309": 1714, "672,121": 1715, "90,70": 1716, "103,117": 1717, "286,32": 1718, "100,287": 1719, "643,341": 1720, "333,264": 1721, "111,267": 1722, "261,165": 1723, "324,337": 1724, "435,429": 1725, "98,320": 1726, "263,480": 1727, "432,406": 1728, "384,1585": 1729, "955,515": 1730, "370,110": 1731, "53,32": 1732, "263,453": 1733, "931,295": 1734, "99,1075": 1735, "104,843": 1736, "1428,286": 1737, "1384,1583": 1738, "881,302": 1739, "534,289": 1740, "540,116": 1741, "1078,990": 1742, "444,97": 1743, "458,54": 1744, "110,616": 1745, "458,55": 1746, "547,181": 1747, "300,130": 1748, "283,168": 1749, "844,591": 1750, "112,262": 1751, "387,97": 1752, "108,477": 1753, "835,391": 1754, "1013,291": 1755, "279,678": 1756, "998,1421": 1757, "1757,421": 1758, "396,504": 1759, "291,597": 1760, "639,336": 1761, "108,446": 1762, "116,582": 1763, "353,582": 1764, "101,105": 1765, "818,268": 1766, "395,438": 1767, "511,328": 1768, "256,150": 1769, "458,52": 1770, "87,1171": 1771, "196,129": 1772, "888,1524": 1773, "423,858": 1774, "346,100": 1775, "80,108": 1776, "80,265": 1777, "1109,887": 1778, "1390,1641": 1779, "65,70": 1780, "420,1312": 1781, "101,447": 1782, "304,278": 1783, "112,320": 1784, "1126,294": 1785, "896,116": 1786, "97,104": 1787, "432,32": 1788, "288,161": 1789, "574,183": 1790, "32,10": 1791, "310,460": 1792, "32,260": 1793, "512,437": 1794, "1358,545": 1795, "280,417": 1796, "100,327": 1797, "66,67": 1798, "864,663": 1799, "1275,392": 1800, "82,1660": 1801, "411,362": 1802, "699,119": 1803, "262,579": 1804, "1239,1231": 1805, "258,524": 1806, "391,349": 1807, "589,268": 1808, "945,1142": 1809, "343,720": 1810, "302,299": 1811, "439,133": 1812, "350,402": 1813, "39,267": 1814, "647,333": 1815, "76,291": 1816, "279,822": 1817, "644,257": 1818, "280,480": 1819, "913,107": 1820, "41,390": 1821, "352,922": 1822, "114,340": 1823, "618,257": 1824, "384,469": 1825, "267,657": 1826, "360,1695": 1827, "846,281": 1828, "76,101": 1829, "531,274": 1830, "288,149": 1831, "439,184": 1832, "280,400": 1833, "372,632": 1834, "1455,1712": 1835, "1835,471": 1836, "109,360": 1837, "814,308": 1838, "718,292": 1839, "1268,280": 1840, "258,398": 1841, "115,1270": 1842, "72,101": 1843, "263,110": 1844, "120,399": 1845, "98,325": 1846, "1536,646": 1847, "279,102": 1848, "348,325": 1849, "108,111": 1850, "32,314": 1851, "102,1189": 1852, "70,500": 1853, "69,1182": 1854, "384,427": 1855, "286,68": 1856, "871,687": 1857, "272,1663": 1858, "104,1802": 1859, "99,863": 1860, "303,474": 1861, "420,1373": 1862, "1038,605": 1863, "49,50": 1864, "262,270": 1865, "105,262": 1866, "115,1204": 1867, "322,882": 1868, "107,101": 1869, "300,166": 1870, "256,162": 1871, "408,421": 1872, "338,174": 1873, "109,921": 1874, "259,45": 1875, "812,686": 1876, "119,1046": 1877, "304,285": 1878, "262,101": 1879, "109,309": 1880, "67,309": 1881, "862,588": 1882, "852,740": 1883, "78,1714": 1884, "1884,101": 1885, "692,671": 1886, "1232,266": 1887, "584,636": 1888, "769,1047": 1889, "1764,607": 1890, "344,401": 1891, "529,963": 1892, "351,612": 1893, "316,652": 1894, "700,554": 1895, "602,1185": 1896, "98,371": 1897, "265,361": 1898, "518,1255": 1899, "352,902": 1900, "118,284": 1901, "97,119": 1902, "341,373": 1903, "32,974": 1904, "1340,703": 1905, "819,116": 1906, "705,294": 1907, "307,514": 1908, "259,273": 1909, "101,319": 1910, "83,32": 1911, "109,340": 1912, "393,295": 1913, "107,263": 1914, "55,32": 1915, "109,313": 1916, "98,331": 1917, "49,52": 1918, "522,351": 1919, "346,404": 1920, "116,270": 1921, "843,335": 1922, "483,262": 1923, "649,909": 1924, "84,320": 1925, "1291,342": 1926, "66,331": 1927, "1482,423": 1928, "854,294": 1929, "542,786": 1930, "1067,321": 1931, "619,269": 1932, "1217,294": 1933, "578,100": 1934, "298,434": 1935, "105,266": 1936, "79,339": 1937, "101,45": 1938, "115,99": 1939, "1359,257": 1940, "332,335": 1941, "458,56": 1942, "337,276": 1943, "1111,442": 1944, "441,713": 1945, "257,40": 1946, "649,263": 1947, "1494,1471": 1948, "281,331": 1949, "1480,339": 1950, "368,118": 1951, "117,98": 1952, "857,266": 1953, "1927,1568": 1954, "108,108": 1955, "97,333": 1956, "1009,110": 1957, "384,986": 1958, "108,720": 1959, "1136,41": 1960, "733,270": 1961, "273,538": 1962, "286,69": 1963, "111,102": 1964, "345,491": 1965, "298,10": 1966, "483,319": 1967, "302,40": 1968, "564,443": 1969, "1842,369": 1970, "413,467": 1971, "295,40": 1972, "105,336": 1973, "409,268": 1974, "378,510": 1975, "658,99": 1976, "97,122": 1977, "291,312": 1978, "104,463": 1979, "413,1629": 1980, "1600,305": 1981, "528,342": 1982, "516,446": 1983, "104,877": 1984, "624,32": 1985, "740,116": 1986, "311,116": 1987, "112,355": 1988, "263,562": 1989, "866,446": 1990, "455,436": 1991, "1327,1595": 1992, "466,100": 1993, "377,461": 1994, "73,73": 1995, "99,121": 1996, "288,129": 1997, "310,1186": 1998, "631,329": 1999}}